src/cf/Catalogs/sms4bШаблоны.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>sms4bШаблоны</Name>
			<Comment>Шаблоны заполнения содержания сообщений SMS</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Comment>Содержание шаблона</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_ШаблонОповещения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/sms4bШаблоны/Forms/ФормаВыбора/Ext/Form/Module.bsl
// +CRM

&НаСервере
Функция ПолучитьШаблон(ВыбраннаяСтрока)
    
    Структура = Новый Структура;
    Структура.Вставить("Содержание", ВыбраннаяСтрока.Содержание);
    
    Возврат Структура;
    
КонецФункции

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если CRM_ШаблонОповещения Тогда Возврат; КонецЕсли;
	ОповеститьОВыборе(ПолучитьШаблон(ВыбраннаяСтрока));
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если НЕ Копирование И НЕ Группа Тогда
		Отказ = Истина;
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ШаблонОповещения",CRM_ШаблонОповещения);
		ОткрытьФорму("Справочник.sms4bШаблоны.ФормаОбъекта",ПараметрыФормы,Элементы.Список);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Список.Отбор.Элементы.Количество() = 1 
		И Список.Отбор.Элементы[0].ЛевоеЗначение = Новый ПолеКомпоновкиДанных("CRM_ШаблонОповещения") Тогда
		CRM_ШаблонОповещения = Список.Отбор.Элементы[0].ПравоеЗначение;
	Иначе
		CRM_ШаблонОповещения = Ложь;
	КонецЕсли;
	
	ЭтотОбъект.АвтоЗаголовок = Ложь;
	ЭтотОбъект.Заголовок = ?(CRM_ШаблонОповещения,НСтр("ru = 'Шаблоны сообщений SMS (Для оповещений)'"),НСтр("ru = 'Шаблоны сообщений SMS (Для рассылок)'"));
	
КонецПроцедуры
 
// -CRM
